#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lsitc-sypark/gh-actions-sypark/runs/run-uBFnrffqHyy6DfY3

Waiting for the plan to start...

Terraform v1.0.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_key_pair.wordpress-app-shpark: Refreshing state... [id=app-key]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ec21b78f932d9f16]
aws_key_pair.wordpress-bastion-shpark: Refreshing state... [id=bastion-key]
aws_eip.bast_eip_shpark: Refreshing state... [id=eipalloc-0fca04ced4430f7c9]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0320d6a82a1088b49]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e016bbe7ce740a52]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-085fce79e8f165192]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0dad97e8ce3d51680]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:462303565796:targetgroup/alb-tag-shpark/5a31a78fd9e73fb4]
module.alb_http_sg.module.sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0f2bfee30362398cc]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-00b6f9eb979abddcf]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ece9310289e6d32b]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-0aed28447b57d836c]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-0e8e3cee326a6bce4]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0254aeb652a0fcd9f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d6409380b83d81db]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-0d51c520833578ba4]
module.bastion_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0bd9e71adda633b5e]
module.asg_ssh_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-01ff340e54a72ba9a]
module.asg_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-095e5fd26f34b66fc]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0fb1e3112bc06fb89]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0254aeb652a0fcd9f1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0860406c67c19ac58]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0bf8deaef10d818c8]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-1449275544]
module.alb_http_sg.module.sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-470064932]
module.alb_http_sg.module.sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2999792515]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0cd4228efa6fb2a5c]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-047437d1579a826dd]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:462303565796:loadbalancer/app/alb-shpark/1264c32d46fac8bc]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-04138acc225ec1ce3]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-090da8ecdfe2ead0c]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d6409380b83d81db1080289494]
module.bastion_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2114704255]
module.bastion_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-601496468]
module.asg_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1466125037]
module.asg_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3576041788]
module.asg_ssh_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1664423980]
module.asg_ssh_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2570553668]
module.bastion_ec2.aws_instance.this[0]: Refreshing state... [id=i-018b0f00be6c0caf1]
module.default_lt.aws_launch_template.this[0]: Refreshing state... [id=lt-046139f48609718c8]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:462303565796:listener/app/alb-shpark/1264c32d46fac8bc/c832b1417e90bbe7]
module.default_lt.aws_autoscaling_group.this[0]: Refreshing state... [id=asg-lt-shpark-20211102021932976700000007]
aws_eip_association.eip_associ_shpark: Refreshing state... [id=eipassoc-02e48313a713e3715]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.bastion_ec2.aws_instance.this[0] has been changed
  ~ resource "aws_instance" "this" {
        id                                   = "i-018b0f00be6c0caf1"
      ~ public_dns                           = "ec2-54-203-35-241.us-west-2.compute.amazonaws.com" -> "ec2-54-214-98-15.us-west-2.compute.amazonaws.com"
      ~ public_ip                            = "54.203.35.241" -> "54.214.98.15"
        tags                                 = {
            "Name" = "wordpress-bastion-shpark"
        }
        # (28 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }
  # module.alb_http_sg.module.sg.aws_security_group.this_name_prefix[0] has been changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0f2bfee30362398cc"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "Ingress Rule"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
        name                   = "alb-http-sg-shpark-20211102021930234000000004"
        tags                   = {
            "Name" = "alb-http-sg-shpark"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.alb_http_sg.module.sg.aws_security_group_rule.egress_rules[0] has been changed
  ~ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-470064932"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }
  # module.alb_http_sg.module.sg.aws_security_group_rule.ingress_with_self[0] has been changed
  ~ resource "aws_security_group_rule" "ingress_with_self" {
      + cidr_blocks              = []
      ~ from_port                = -1 -> 0
        id                       = "sgrule-1449275544"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-0f2bfee30362398cc"
      ~ to_port                  = -1 -> 0
        # (6 unchanged attributes hidden)
    }
  # aws_eip.nat[0] has been changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-032a5fa02917c158a"
        id                   = "eipalloc-0320d6a82a1088b49"
      + network_interface    = "eni-0f19e88ce02e04119"
      + private_dns          = "ip-10-80-11-55.us-west-2.compute.internal"
      + private_ip           = "10.80.11.55"
        tags                 = {
            "Name" = "eip-shpark"
        }
        # (7 unchanged attributes hidden)
    }
  # aws_key_pair.wordpress-app-shpark has been changed
  ~ resource "aws_key_pair" "wordpress-app-shpark" {
        id          = "app-key"
      + tags        = {}
        # (6 unchanged attributes hidden)
    }
  # aws_key_pair.wordpress-bastion-shpark has been changed
  ~ resource "aws_key_pair" "wordpress-bastion-shpark" {
        id          = "bastion-key"
      + tags        = {}
        # (6 unchanged attributes hidden)
    }
  # aws_eip.bast_eip_shpark has been changed
  ~ resource "aws_eip" "bast_eip_shpark" {
      + association_id       = "eipassoc-02e48313a713e3715"
        id                   = "eipalloc-0fca04ced4430f7c9"
      + instance             = "i-018b0f00be6c0caf1"
      + network_interface    = "eni-0b0c7b23928690129"
      + private_dns          = "ip-10-80-11-11.us-west-2.compute.internal"
      + private_ip           = "10.80.11.11"
      + tags                 = {}
        # (7 unchanged attributes hidden)
    }
  # module.asg_ssh_sg.aws_security_group_rule.egress_rules[0] has been changed
  ~ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-2570553668"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }
  # module.asg_ssh_sg.aws_security_group.this_name_prefix[0] has been changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-01ff340e54a72ba9a"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.80.11.11/32",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "ags-ssh-sg-shpark-20211102021929730100000003"
        tags                   = {
            "Name" = "asg-ssh-sg-shpark"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.vpc.aws_route_table.public[0] has been changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0254aeb652a0fcd9f"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0e016bbe7ce740a52"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "rt-public-shpark"
        }
        # (5 unchanged attributes hidden)
    }
  # module.vpc.aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0d6409380b83d81db"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0fb1e3112bc06fb89"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "rt-private-shpark"
        }
        # (5 unchanged attributes hidden)
    }
  # module.asg_sg.aws_security_group_rule.egress_rules[0] has been changed
  ~ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-3576041788"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }
  # module.asg_sg.aws_security_group.this_name_prefix[0] has been changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-095e5fd26f34b66fc"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Ingress Rule"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0f2bfee30362398cc",
                ]
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "asg-sg-shpark-20211102021929719700000002"
        tags                   = {
            "Name" = "asg-sg-shpark"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.asg_sg.aws_security_group_rule.computed_ingress_with_source_security_group_id[0] has been changed
  ~ resource "aws_security_group_rule" "computed_ingress_with_source_security_group_id" {
      + cidr_blocks              = []
        id                       = "sgrule-1466125037"
      + ipv6_cidr_blocks         = []
        # (9 unchanged attributes hidden)
    }
  # module.default_lt.aws_autoscaling_group.this[0] has been changed
  ~ resource "aws_autoscaling_group" "this" {
      + enabled_metrics           = []
        id                        = "asg-lt-shpark-20211102021932976700000007"
      + load_balancers            = []
        name                      = "asg-lt-shpark-20211102021932976700000007"
      + suspended_processes       = []
      ~ tags                      = [
          - {
              - "Name" = "asg-lt-shpark"
            },
            # (1 unchanged element hidden)
        ]
      + termination_policies      = []
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.default_lt.aws_launch_template.this[0] has been changed
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-046139f48609718c8"
        name                    = "asg-lt-shpark-20211102021931918900000005"
      + security_group_names    = []
      + tags                    = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.bastion_sg.aws_security_group_rule.egress_rules[0] has been changed
  ~ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-601496468"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }
  # module.bastion_sg.aws_security_group.this_name_prefix[0] has been changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0bd9e71adda633b5e"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "211.168.91.10/32",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "bastion-sg-shpark-20211102021929701700000001"
        tags                   = {
            "Name" = "bastion-sg-shpark"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_key_pair.wordpress-db-shpark will be created
  + resource "aws_key_pair" "wordpress-db-shpark" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "db-key"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDkeAo+OG0mI4V+aquTqs+vKQw6d24bQWpP9UleVw5nb4nm+a993WN1A1HPYGoZKwwW54V+B2SEczPZ1Wrs/uXFSe1jRTZ2BTrXqo0g6xtNi5AFRGnni7lNAHKzYM7smqSGWOl7uTpC0nHertMclkXpeHXlLIValeCbZDYfwlLlQe7jcGkPGD8UHVuZxw3cHZ4ye7uvXWqJUVGjQlWKVih4R2++ge2/i3A5bZfP8vxRFS7NtBaOmL+WCqe8HHjtwDv1wHu0w+RSZd/MetHOCOJ6BeyJV1aIAlwYXDu46ib/B8gUmcj7NE80SvtMgYjOvo2OMVtfrURbi371cou7ufETFyhVb9GnSeCbQtmvmVRLixe8B4pyKSLsxysU9D5ZfmyNal2wYMEiER5SvPhVJ3PJm+3LG+DhgBDx3UkovqMNgi4AeYZC1GuHgv7IMae4OVuDbE1ZKaq/HwBD+wGd6CxS+LKGL5a6VtY/NMbGlF28hPYGBFb6vuAqp8b4mqMZ7yjM4uEnlUGhmopHCcLN+emLqtdgHEYHXQgaA7rBuaKBhl77RDQsmCA9bKgA9Yc+7NEnapq7PvSuKIQMpm4LSl4H+d21b0ICHqa2BHCHrTYeIRNltnFo5t7Ca6i5az1b3Tl7ye99Rc2eoOjdBnYwvJ8RItCtMKSy8QE2ILDjdXiuIQ== orpsh1941@LSITC-2021351"
      + tags_all    = (known after apply)
    }

  # module.db_ec2.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-03d5c68bab01f3496"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "us-west-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "bastion-key"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = "10.80.31.31"
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0aed28447b57d836c"
      + tags                                 = {
          + "Name" = "db-shpark"
        }
      + tags_all                             = {
          + "Name" = "db-shpark"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + volume_tags                          = {
          + "Name" = "db-shpark"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.db_mysql_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "db-sg-shpark-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "db-sg-shpark"
        }
      + tags_all               = {
          + "Name" = "db-sg-shpark"
        }
      + vpc_id                 = "vpc-0ec21b78f932d9f16"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.db_mysql_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.db_mysql_sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.80.21.0/24",
          + "10.80.22.0/24",
        ]
      + description              = "MySQL/Aurora"
      + from_port                = 3306
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.db_ssh_sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "db-ssh-sg-shpark-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "db-ssh-sg-shpark"
        }
      + tags_all               = {
          + "Name" = "db-ssh-sg-shpark"
        }
      + vpc_id                 = "vpc-0ec21b78f932d9f16"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.db_ssh_sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.db_ssh_sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.80.11.11/32",
          + "10.80.21.0/24",
          + "10.80.22.0/24",
        ]
      + description              = "SSH"
      + from_port                = 22
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.default_lt.aws_autoscaling_group.this[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "this" {
        id                        = "asg-lt-shpark-20211102021932976700000007"
        name                      = "asg-lt-shpark-20211102021932976700000007"
      ~ tags                      = [
          + {
              + "Name" = "asg-lt-shpark"
            },
            # (1 unchanged element hidden)
        ]
        # (23 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 8 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ bastion_ec2_public_dns                      = "ec2-54-203-35-241.us-west-2.compute.amazonaws.com" -> "ec2-54-214-98-15.us-west-2.compute.amazonaws.com"
  ~ bastion_ec2_public_ip                       = "54.203.35.241" -> "54.214.98.15"
  + default_lt_autoscaling_group_load_balancers = []

```
</details>
*Pusher: @ShinhyeongPark, Action: `pull_request`*